app/controllers/home_controller.rb

SELECT "weathers".* FROM "weathers"  ORDER BY id desc
SELECT "weathers".* FROM "weathers"
---
  def index
    @weathers = Weather.order('id desc')
    # @hash = Gmaps4rails.build_markers(@weathers) do |weather, marker|
    #   marker.lat weather.lat
    #   marker.lng weather.long
    # end

    @hash = []
    @weathers.each do |w|