app/controllers/weathers_controller.rb

  def index
    @weathers = Weather.all
---
SELECT "weathers".* FROM "weathers"

  def create
    @weather = Weather.new(weather_params)

    respond_to do |format|
      if @weather.save
---
INSERT INTO "weathers" ("lat", "long", "info", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", 23.43], ["long", 90.96], ["info", "It's Cloudy"], ["picture", "123.png"], ["created_at", "2015-12-14 18:49:59.472838"], ["updated_at", "2015-12-14 18:49:59.472838"]]

  def update
    respond_to do |format|
      if @weather.update(weather_params)
---
UPDATE "weathers" SET "picture" = $1, "updated_at" = $2 WHERE "weathers"."id" = $3  [["picture", "images.jpg"], ["updated_at", "2015-12-14 00:14:12.621068"], ["id", 4]]

    def set_weather
      @weather = Weather.find(params[:id])
---
SELECT  "weathers".* FROM "weathers" WHERE "weathers"."id" = $1 LIMIT 1  [["id", 4]]