app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    auth = request.env['omniauth.auth']
    #@user = User.where(auth.slice('provider', 'uid')).first
    @user = User.where(provider: auth.provider, uid: auth.uid).first

    if @user.present?
      sign_in(@user, event: :authentication)
      redirect_to session.has_key?(:return_url) ? session.delete(:return_url) : root_path
    else
      @user = User.create_from_omniauth_facebook auth
---
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "facebook"], ["uid", "10153115112824370"]]
INSERT INTO "users" ("first_name", "last_name", "provider", "uid", "encrypted_password", "last_sign_in_at", "current_sign_in_at", "last_sign_in_ip", "current_sign_in_ip", "sign_in_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"